#+OPTIONS: toc:nil
#+OPTIONS: ^:nil
* First Steps :noexport:

#+BEGIN_SRC R :session :results output
require(stockfighterr)
require(sfobjects)
p <- parse_quote(q)
#+END_SRC

#+RESULTS:
: Error in as.list.default(X) (from Debugging.org!5628Tsr#2) :
:   no method for coercing this S4 class to a vector
* Trace
- Trace with no arguments reports when a function is called
#+BEGIN_SRC R :session :results output :exports both
stupidfunc <- function(x, y) {res <- x + y}
stupiderfunc <- function(n) {
    res <- vector(length=n)
    for(i in 1:n) {
        res[i] <- stupidfunc(i, 2)
    }
    }
trace(stupidfunc)
stupiderfunc(10)
#+END_SRC

#+RESULTS:
#+begin_example
trace: stupidfunc
trace: stupidfunc
trace: stupidfunc
trace: stupidfunc
trace: stupidfunc
trace: stupidfunc
trace: stupidfunc
trace: stupidfunc
trace: stupidfunc
trace: stupidfunc
#+end_example


* Even More Trace :noexport:
- More generally, trace has some arguments that accept unevaluated expressions and take action inside the traced function based on these
#+BEGIN_SRC R :session :results output :eval no
## trace(stupiderfunc)
## ## trace(stupiderfunc, tracer=quote(cat(sprintf("i is %d\n", i))))
## trace(pt) ## would show ~20 calls, but we want to see more:
##      trace(pt, tracer = quote(cat(sprintf("tracing pt(*, ncp = %.15g)\n", ncp))),
##            print = FALSE) # <- not showing typical extra
##      power.t.test(20, 1, power=0.8, sd=NULL)  ##--> showing the ncp root finding:
##      untrace(pt)
#+END_SRC

#+RESULTS:
#+begin_example
 trace: sum
Tracing function "pt" in package "stats"
[1] "pt"
trace: sum
tracing pt(*, ncp = 31622776.6016838)
tracing pt(*, ncp = 3.16227766016838e-07)
tracing pt(*, ncp = 1.54161033083713e-06)
tracing pt(*, ncp = 7.51534968562983e-06)
tracing pt(*, ncp = 3.66373136232471e-05)
tracing pt(*, ncp = 0.000178606521414343)
tracing pt(*, ncp = 0.000870697700373358)
tracing pt(*, ncp = 0.00424443508523481)
tracing pt(*, ncp = 0.0206864667531106)
tracing pt(*, ncp = 0.100722153608784)
tracing pt(*, ncp = 0.48783816205104)
tracing pt(*, ncp = 2.27122420983028)
tracing pt(*, ncp = 4.54127936549001)
tracing pt(*, ncp = 3.04551810443699)
tracing pt(*, ncp = 2.82497901757656)
tracing pt(*, ncp = 2.87564199633926)
tracing pt(*, ncp = 2.87492378604085)
tracing pt(*, ncp = 2.87476426843053)
tracing pt(*, ncp = 2.87492378604085)

     Two-sample t test power calculation

              n = 20
          delta = 1
             sd = 1.099952
      sig.level = 0.05
          power = 0.8
    alternative = two.sided

NOTE: n is number in *each* group
trace: sum
Untracing function "pt" in package "stats"
#+end_example
* Try
- The simplest way to do this is try
#+BEGIN_SRC R :session :results output :eval no
## a <- "a"
## 1+a
#+END_SRC

#+RESULTS:
: Error in 1 + a : non-numeric argument to binary operator
#+BEGIN_SRC R :session :results verbatim
err <- try(1+a, silent=TRUE)
class(err)
#+END_SRC

#+RESULTS:
 "try-error"
=- So now we can record each of the errors and (potentially take some action based on them)
* tryCatch
- TryCatch is a more general form of try
- Using this, we can take different actions based on what happened in the function
#+BEGIN_SRC R :session :results output :exports both
conditions <- function(code) {
    tryCatch(code,
             error=function(c) "error",
             warning=function(c) "warning",
             message=function(c) "message"
             )

}
conditions(stop(1+2))
conditions(warning(1+2))
conditions(message(1+2))
#+END_SRC

#+RESULTS:
: [1] "error"
: [1] "warning"
: [1] "message"

- If the code is successful, the result is returned
- Otherwise, the respective condition function is evaluated
- So, for instance, if we were trying to get a bunch of webpages, then we could log errors (and potentially retry) and warnings, while using message to report on the progress which was made
#+BEGIN_SRC R :session :results none :exports none
rentals <- readRDS("~/Dropbox/Data/Rentals/testtrain_data.rds")
#+END_SRC
* Better Examples
#+BEGIN_SRC R :session :exports both :results output
message_handler <- function(m) message(m)
warning_handler <- function(w) warning(w)
error_handler <- function(e) simpleError(
                                 message="simple error",
                                 call=e)
ok_res <- tryCatch(expr=1+1,
         message=message_handler,
         warning=warning_handler,
         error=error_handler)

warning_res <- tryCatch(expr=as.integer(2^32+1),
         message=message_handler,
         warning=warning_handler,
         error=error_handler)

error_res <- tryCatch(expr=1+a,
         message=message_handler,
         warning=warning_handler,
         error=error_handler)


#+END_SRC

#+RESULTS:
:  Warning message:
: In doTryCatch(return(expr), name, parentenv, handler) :
:   NAs introduced by coercion to integer range

* Custom Conditions
- You can create custom conditions
- They should inherit from error, warning or message if you want them to work
- They must contain message and call components

#+BEGIN_SRC R :session :results verbatim :exports both
#shamelessly stolen from advanced R, Wickham (2014)
condition <- function(subclass, message, call = sys.call(-1), ...) {
  structure(
    class = c(subclass, "condition"),
    list(message = message, call = call, ...)
  )
}
is.condition <- function(x) inherits(x, "condition")
myerr <- condition("error", message="this is my error")
is.condition(myerr)
#+END_SRC

#+RESULTS:
=TRUE
